
public class task_one {
	/*
	 * 1. Объявить несколько переменных, содержащих население европейских стран (3-5 штук). 
	 * Вывести в консоль информацию по странам. 
	 * Например: "Германия: 80620000 человек".
	 */
	
	int german = 80620000;
	int ukrman= 50000000;
	int spainman = 46000000;
	int italianman = 80000000;
	int usaman =380000000;
	System.out.println("Германия: "+ german + " человек");
	System.out.println("Украина: "+ ukrman + " человек");
	System.out.println("Испания: "+ spainman + " человек");
	System.out.println("Италия: "+ italianman + " человек");
	System.out.println("США: "+ usaman + " человек");
}
